[
["The User","the.user@mail.com","The user of the system."],
["The Agent","the.agent@mail.com","An agent in the system."],
["Kenneth H. Rosen","kenneth.h.rosen@att.com", "Kenneth H. Rosen has had a long career as a Distinguished Member of the Technical Staff at AT&T Laboratories in Monmouth County, New Jersey. He currently holds the position of Visiting Research Professor at Monmouth University, where he teaches graduate courses in computer science. Dr. Rosen received his B.S. in Mathematics from the University of Michigan, Ann Arbor (1972), and his Ph.D. in Mathematics from M.I.T. (1976), where he wrote his thesis in the area of number theory under the direction of Harold Stark. Before joining Bell Laboratories in 1982, he held positions at the University of Colorado, Boulder; The Ohio State University, Columbus; and the University of Maine, Orono, where he was an associate professor of mathematics. While working at AT&T Labs, he taught at Monmouth University, teaching courses in discrete mathematics, coding theory, and data security. He currently teaches courses in algorithm design and in computer security and cryptography. Dr. Rosen has published numerous articles in professional journals in number theory and in mathematical modeling. He is the author of the widely used Elementary Number Theory and Its Applications, published by Pearson, currently in its sixth edition, which has been translated into Chinese. He is also the author of Discrete Mathematics and Its Applications, published by McGraw-Hill, currently in its seventh edition. Discrete Mathematics and Its Applications has sold more than 350,000 copies in North America during its lifetime, and hundreds of thousands of copies throughout the rest of the world. This book has also been translated into Spanish, French, Greek, Chinese,Vietnamese, and Korean. He is also co-author of UNIX: The Complete Reference; UNIX SystemV Release 4:An Introduction; and Best UNIXTips Ever, all published by Osborne McGraw-Hill. These books have sold more than 150,000 copies, with translations into Chinese, German, Spanish, and Italian. Dr. Rosen is also the editor of the Handbook of Discrete and Combinatorial Mathematics, published by CRC Press, and he is the advisory editor of the CRC series of books in discrete mathematics, consisting of more than 55 volumes on different aspects of discrete mathematics, most of which are introduced in this book. Dr. Rosen serves as an Associate Editor for the journal Discrete Mathematics, where he works with submitted papers in several areas of discrete mathematics, including graph theory, enumeration, and number theory. He is also interested in integrating mathematical software into the educational and professional environments, and worked on several projects with Waterloo Maple Inc.’s MapleTM software in both these areas. Dr. Rosen has also worked with several publishing companies on their homework delivery platforms. At Bell Laboratories andAT&T Laboratories, Dr. Rosenworked on a wide range of projects, including operations research studies, product line planning for computers and data communications equipment, and technology assessment. He helped planAT&T’s products and services in the area of multimedia, including video communications, speech recognition, speech synthesis, and image networking. He evaluated new technology for use by AT&T and did standards work in the area of image networking. He also invented many new services, and holds more than 55 patents. One of his more interesting projects involved helping evaluate technology for the AT&T attraction that was part of EPCOT Center."],
["Godfried Toussaint", "godfried.toussaint@nyuad.nyu.edu", "A Canadian computer scientist, a professor of computer science, and the head of the Computer Science Program at New York University Abu Dhabi (NYUAD) in Abu Dhabi, United Arab Emirates. He is considered to be the father of computational geometry in Canada. He did research on various aspects of computational geometry, discrete geometry, and their applications: pattern recognition (k-nearest neighbor algorithm, cluster analysis), motion planning, visualization (computer graphics), knot theory (stuck unknot problem), linkage (mechanical) reconfiguration, the art gallery problem, polygon triangulation, the largest empty circle problem, unimodality (unimodal function), and others. Other interests included meander (art), compass and straightedge constructions, instance-based learning, music information retrieval, and computational music theory."],
["Harold Stark","Harold.Stark@umich.edu", "Harold Mead Stark (born August 6, 1939) is an American mathematician, specializing in number theory. He is best known for his solution[2] of the Gauss class number 1 problem, in effect correcting and completing the earlier work of Kurt Heegner, and for Stark's conjecture. More recently, he collaborated with Audrey Terras to study zeta functions in graph theory. He is currently on the faculty of the University of California, San Diego."],
["Richard P. Stanley","Richard.P.Stanley@mit.edu", "Notable for his work in combinatorics, particularly in enumerative combinatorics. Richard Peter Stanley (born June 23, 1944) is an Emeritus Professor of Mathematics at the Massachusetts Institute of Technology, and an Arts and Sciences Distinguished Scholar at the University of Miami. From 2000 to 2010, he was the Norman Levinson Professor of Applied Mathematics. He received his Ph.D. at Harvard University in 1971 under the supervision of Gian-Carlo Rota. He is an expert in the field of combinatorics and its applications to other mathematical disciplines."],
["Thomas H. Cormen","Thomas.H.Cormen@princeton.edu", "Co-author of 'Introduction to Algorithms', a widely used textbook in computer science. He is an American politician and retired academic. He is the co-author of Introduction to Algorithms, along with Charles Leiserson, Ron Rivest, and Cliff Stein. In 2013, he published a new book titled Algorithms Unlocked. He is an emeritus professor of computer science at Dartmouth College and former chairman of the Dartmouth College Department of Computer Science. Between 2004 and 2008 he directed the Dartmouth College Writing Program. His research interests are algorithm engineering, parallel computing, and speeding up computations with high latency. In 2022, he was elected as a Democratic member of the New Hampshire House of Representatives."],
["Robert Sedgewick","Robert.Sedgewick@princeton.edu", "Recognized for his contributions in algorithms and data structures Robert Sedgewick (born December 20, 1946) is an American computer scientist. He is the founding chair and the William O. Baker Professor in Computer Science at Princeton University and was a member of the board of directors of Adobe Systems (1990–2016). He previously served on the faculty at Brown University and has held visiting research positions at Xerox PARC, Institute for Defense Analyses, and INRIA. His research expertise is in algorithm science, data structures, and analytic combinatorics. He is also active in developing college curriculums in computer science."],
["Donald Trump", "Donald.Trump@whitehouse.gov", "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who has been the 47th and current president of the United States since 2025. A member of the Republican Party, he previously served as the 45th president from 2017 to 2021. Trump graduated with a bachelor's degree in economics from the University of Pennsylvania in 1968. He became president of the Trump family real estate business in 1971 and focused on luxury accommodations. After a series of business bankruptcies in the 1990s, he launched several side ventures. From 2004 to 2015, he hosted and co-produced the reality television series The Apprentice. Trump won the 2016 presidential election. His immigration policy included a temporary travel ban targeting refugees and nationals of certain Muslim-majority countries, and expanding the U.S.–Mexico border wall; he also briefly implemented a family separation policy. He rolled back more than 100 environmental policies and regulations, signed the Tax Cuts and Jobs Act of 2017, initiated a trade war with China in 2018, and withdrew the U.S. from international agreements on climate, trade, and the nuclear program of Iran. Trump became the first sitting U.S. president to enter North Korea when he met with Kim Jong Un; they did not reach an agreement on denuclearization. He nominated three Supreme Court justices in his first term. Trump's response to the COVID-19 pandemic downplayed its severity, contradicted guidance from international public health bodies, and included the CARES Act economic stimulus. He was impeached in 2019 for abuse of power and obstruction of Congress, and in 2021 for incitement of insurrection; the Senate acquitted him in both cases. After his first term, scholars and historians ranked Trump as one of the worst presidents in American history. Trump's politics led to the Trumpism movement. Many of his comments and actions have been characterized as racially charged, racist, and misogynistic. He promoted conspiracy theories and made false and misleading statements during his campaigns and presidency to a degree unprecedented in American politics. He lost the 2020 presidential election but did not concede, falsely claiming widespread electoral fraud and attempting to overturn the results, including through his involvement in the January 6 United States Capitol attack. In civil proceedings, he was found liable for sexual abuse and defamation in 2023, and financial fraud in 2024. He was found guilty of falsifying business records in May 2024 and sentenced to unconditional discharge in January 2025, making him the first U.S. president to be convicted of a felony. Two felony indictments related to interference in the 2020 election and his handling of classified documents were dismissed without prejudice following his victory in the 2024 presidential election."],
["Brian Hugh Warner", "brian.hugh.warner@marilynmanson.net", "Brian Hugh Warner (born January 5, 1969), known professionally as Marilyn Manson, is an American rock musician who rose to prominence as the lead singer (and only constant member) of the band he formed in 1989 with Daisy Berkowitz. The band members created their stage names by combining the first name of an American female sex symbol with the last name of a male serial killer, like actress Marilyn Monroe and cult leader Charles Manson. In the 1990s, the band released the albums Portrait of an American Family (1994), Antichrist Superstar (1996) and Mechanical Animals (1998). In the U.S. alone, three of the band's albums have been awarded platinum status and three more went gold, and the band has had eight releases debut in the top 10, including two No. 1 albums. Manson has been ranked at No. 44 on the list of the 'Top 100 Heavy Metal Vocalists' by Hit Parader and, along with his band, has been nominated for four Grammy Awards – Manson himself earned an additional Grammy nomination for his work on Kanye West's Donda (2021). Manson made his film debut as an actor in David Lynch's Lost Highway (1997), and has since appeared in a variety of minor roles and cameos. In 2002, his first art show, The Golden Age of Grotesque, was held at the Los Angeles Contemporary Exhibitions center. His music and stage personality have earned Manson a reputation in mainstream media as a controversial figure and negative influence on young people.[1][2] He is widely considered one of the most controversial figures in heavy metal, and has been involved in numerous controversies throughout his career. His lyrics were criticized by American politicians and were examined in congressional hearings. Several U.S. states enacted legislation specifically banning the group from performing in state-operated venues. In 1999, news media falsely blamed Manson for influencing the perpetrators of the Columbine High School massacre. His work has been cited in several other violent events; his paintings and films appeared as evidence in a murder trial, and he has been accused of inspiring several other murders and school shootings. In 2021 former partner Evan Rachel Wood accused Manson of psychologically and sexually abusing her, allegations he denied. Four other women followed with similar accusations. He sued Wood for defamation (but later dropped the lawsuit and paid her legal fees)."],
["Sylvester Stallone", "sylvester.stallone@outlook.com", "Sylvester Gardenzio 'Sly' Stallone (/stəˈloʊn/; born July 6, 1946) is an American actor and filmmaker. In a film career spanning more than fifty years, Stallone has received numerous accolades, including a Golden Globe Award and a Critics' Choice Award, as well as nominations for three Academy Awards and two BAFTA Awards. Stallone is one of only two actors in history (alongside Harrison Ford) to have starred in a box-office No. 1 film across six consecutive decades. Struggling as an actor for a number of years upon moving to New York City in 1969, Stallone found gradual work in films such as The Lords of Flatbush (1974). He achieved his greatest critical and commercial success starting in 1976 with his iconic role as boxer Rocky Balboa in the first film of the successful Rocky franchise, which he also wrote. In 1977, he became the third actor in history to be nominated for two Academy Awards for Best Original Screenplay and Best Actor. He portrayed the PTSD-plagued soldier John Rambo in First Blood (1982), a role he would play across five Rambo films (1982–2019). He received a star on the Hollywood Walk of Fame in 1984. From the mid-1980s to the late 1990s, Stallone would go on to become one of Hollywood's highest-paid actors acting in action films such as Cobra (1986), Tango and Cash (1989), Cliffhanger (1993), Demolition Man (1993), and The Specialist (1994). At the height of his career, Stallone was known for his rivalry with Arnold Schwarzenegger. Stallone continued his established roles in Rocky Balboa (2006) and Rambo (2008) before launching The Expendables film franchise (2010–present), in which he starred as the mercenary Barney Ross. In 2013, he starred in the successful film Escape Plan and appeared in its sequels. In 2015, he returned to Rocky again with Creed, in which a retired Rocky mentors former rival Apollo Creed's son Donnie Creed. The film brought Stallone widespread praise and his first Golden Globe Award, as well as a third Academy Award nomination, having been first nominated for the same role 40 years prior. He also starred in the sequel Creed II (2018) and portrayed Stakar Ogord in the Marvel Cinematic Universe films Guardians of the Galaxy Vol. 2 (2017) and Guardians of the Galaxy Vol. 3 (2023). Regarded as an icon of action cinema, Stallone is credited with helping redefine the Hollywood action hero. He has occasionally ventured from the action genre, with mixed results. He starred in the comedies Oscar (1991) and Stop! Or My Mom Will Shoot (1992), both of which had modest success. He also starred in the 1997 drama Cop Land, for which he temporarily shed his sculpted physique and gained weight for his role as a powerless sheriff. In television, he has starred in the Paramount+ crime series Tulsa King (2022–present). In addition to his film work, Stallone is a noted art collector and painter, and has written books on fitness."],
["Mel Gibson", "mel.gibson@outlook.com", "Mel Columcille Gerard Gibson (born January 3, 1956) is an American actor and filmmaker. The recipient of multiple accolades, he is known for directing historical films as well for his action hero roles, particularly his breakout role as Max Rockatansky in the first three films of the post-apocalyptic series Mad Max (1979–1985) and as Martin Riggs in the buddy cop series Lethal Weapon (1987–1998). Born in Peekskill, New York, Gibson moved with his parents to Sydney, Australia, when he was 12 years old. He studied acting at the National Institute of Dramatic Art, where he starred opposite Judy Davis in a production of Romeo and Juliet. During the 1980s, he founded Icon Entertainment, a production company. Director Peter Weir cast him as one of the leads in the World War I drama Gallipoli (1981), which earned Gibson a Best Actor Award from the Australian Film Institute. In 1995, Gibson produced, directed, and starred in the war film Braveheart for which he won the Golden Globe Award for Best Director, the Academy Award for Best Director, and the Academy Award for Best Picture. He later directed and produced The Passion of the Christ (2004), a biblical drama that was both financially successful and highly controversial. He received further critical notice for directing the action-adventure film Apocalypto (2006), set in Mesoamerica during the early 16th century. His notable acting roles during this period were in Ransom (1996), Payback (1999), What Women Want (2000), The Patriot (2000), and Signs (2002). After several legal issues and controversial statements leaked to the public, Gibson's popularity in Hollywood declined, affecting his career. He subsequently starred in Edge of Darkness (2010) and Jodie Foster's The Beaver (2011). His directorial comeback after an absence of 10 years, Hacksaw Ridge (2016), won two Academy Awards."]
]