[
["The User","the.user@mail.com","The user of the system."],
["The Agent","the.agent@mail.com","An agent in the system."],
["Jesus Of Nazareth","Jesus@heaven.com","Jesus (c. 6 to 4 BC – AD 30 or 33), also referred to as Jesus Christ, Jesus of Nazareth, and many other names and titles, was a first-century Jewish preacher and religious leader. He is the central figure of Christianity, the world's largest religion. Most Christian denominations believe Jesus to be the incarnation of God the Son and the awaited messiah, or Christ, a descendant from the Davidic line that is prophesied in the Old Testament. Virtually all modern scholars of antiquity agree that Jesus existed historically. Accounts of Jesus's life are contained in the Gospels, especially the four canonical Gospels in the New Testament. Academic research has yielded various views on the historical reliability of the Gospels and how closely they reflect the historical Jesus. Jesus was circumcised at eight days old, was baptized by John the Baptist as a young adult, and after 40 days and nights of fasting in the wilderness, began his own ministry. He was an itinerant teacher who interpreted the law of God with divine authority and was often referred to as 'rabbi'. Jesus often debated with his fellow Jews on how to best follow God, engaged in healings, taught in parables, and gathered followers, among whom twelve were appointed as his chosen apostles. He was arrested in Jerusalem and tried by the Jewish authorities, turned over to the Roman government, and crucified on the order of Pontius Pilate, the Roman prefect of Judaea. After his death, his followers became convinced that he rose from the dead, and following his ascension, the community they formed eventually became the early Christian Church that expanded as a worldwide movement. It is hypothesized that accounts of his teachings and life were initially conserved by oral transmission, which was the source of the written Gospels. Christian theology includes the beliefs that Jesus was conceived by the Holy Spirit, was born of a virgin named Mary, performed miracles, founded the Christian Church, died by crucifixion as a sacrifice to achieve atonement for sin, rose from the dead, and ascended into Heaven, from where he will return. Commonly, Christians believe Jesus enables people to be reconciled to God. The Nicene Creed asserts that Jesus will judge the living and the dead, either before or after their bodily resurrection, an event tied to the Second Coming of Jesus in Christian eschatology. The great majority of Christians worship Jesus as the incarnation of God the Son, the second of three persons of the Trinity. The birth of Jesus is celebrated annually, generally on 25 December, as Christmas. His crucifixion is honoured on Good Friday and his resurrection on Easter Sunday. The world's most widely used calendar era—in which the current year is AD 2025 (or 2025 CE)—is based on the approximate birthdate of Jesus. In Islam, Jesus is considered the messiah and a prophet of God, who was sent to the Israelites and will return to Earth before the Day of Judgement. Muslims believe Jesus was born of the virgin Mary but was neither God nor a son of God. Most Muslims do not believe that he was killed or crucified but that God raised him into Heaven while he was still alive. Jesus is also revered in the Baháʼí Faith, Druze and Rastafari. In contrast, Judaism rejects the belief that Jesus was the awaited Messiah, arguing that he did not fulfill messianic prophecies, was not lawfully anointed and was neither divine nor resurrected."],
["Muhammad","Muhammad@islam.sa","Muhammad (c. 570 – 8 June 632 CE) was an Arab religious and political leader and the founder of Islam. According to Islam, he was a prophet who was divinely inspired to preach and confirm the monotheistic teachings of Adam, Noah, Abraham, Moses, Jesus, and other prophets. He is believed to be the Seal of the Prophets in Islam, and along with the Quran, his teachings and normative examples form the basis for Islamic religious belief. Muhammad was born c. 570 CE in Mecca. He was the son of Abdullah ibn Abd al-Muttalib and Amina bint Wahb. His father, Abdullah, the son of Quraysh tribal leader Abd al-Muttalib ibn Hashim, died around the time Muhammad was born. His mother Amina died when he was six, leaving Muhammad an orphan. He was raised under the care of his grandfather, Abd al-Muttalib, and paternal uncle, Abu Talib. In later years, he would periodically seclude himself in a mountain cave named Hira for several nights of prayer. When he was 40, c. 610, Muhammad reported being visited by Gabriel in the cave and receiving his first revelation from God. In 613, Muhammad started preaching these revelations publicly, proclaiming that 'God is One', that complete 'submission' (Islām) to God (Allāh) is the right way of life (dīn), and that he was a prophet and messenger of God, similar to the other prophets in Islam. Muhammad's followers were initially few in number, and experienced persecution by Meccan polytheists for 13 years. To escape ongoing persecution, he sent some of his followers to Abyssinia in 615, before he and his followers migrated from Mecca to Medina (then known as Yathrib) later in 622. This event, the Hijrah, marks the beginning of the Islamic calendar, also known as the Hijri calendar. In Medina, Muhammad united the tribes under the Constitution of Medina. In December 629, after eight years of intermittent fighting with Meccan tribes, Muhammad gathered an army of 10,000 Muslim converts and marched on the city of Mecca. The conquest went largely uncontested, and Muhammad seized the city with minimal casualties. In 632, a few months after returning from the Farewell Pilgrimage, he fell ill and died. By the time of his death, most of the Arabian Peninsula had converted to Islam. The revelations (waḥy) that Muhammad reported receiving until his death form the verses (āyah) of the Quran, upon which Islam is based, are regarded by Muslims as the verbatim word of God and his final revelation. Besides the Quran, Muhammad's teachings and practices, found in transmitted reports, known as hadith, and in his biography (sīrah), are also upheld and used as sources of Islamic law. Apart from Islam, Muhammad is regarded as one of the prophets in the Druze faith and a Manifestation of God in the Baháʼí Faith."],
["Buddha","Siddhartha.Gautama@Buddhanet.net","Siddhartha Gautama, most commonly referred to as the Buddha (lit. 'the awakened one'), was a wandering ascetic and religious teacher who lived in South Asia, during the 6th or 5th century BCE and founded Buddhism. According to Buddhist legends, he was born in Lumbini, in what is now Nepal, to royal parents of the Shakya clan, but renounced his home life to live as a wandering ascetic. After leading a life of mendicancy, asceticism, and meditation, he attained nirvana at Bodh Gaya in what is now India. The Buddha then wandered through the lower Indo-Gangetic Plain, teaching and building a monastic order. Buddhist tradition holds he died in Kushinagar and reached parinirvana ('final release from conditioned existence'). According to Buddhist tradition, the Buddha taught a Middle Way between sensual indulgence and severe asceticism, leading to freedom from ignorance, craving, rebirth, and suffering. His core teachings are summarized in the Four Noble Truths and the Noble Eightfold Path, a training of the mind that includes ethical training and kindness toward others, and meditative practices such as sense restraint, mindfulness, dhyana (meditation proper). Another key element of his teachings are the concepts of the five skandhas and dependent origination, describing how all dharmas (both mental states and concrete 'things') come into being, and cease to be, depending on other dharmas, lacking an existence on their own svabhava). A couple of centuries after his death, he came to be known by the title Buddha, which means 'Awakened One' or 'Enlightened One'. His teachings were compiled by the Buddhist community in the Vinaya, his codes for monastic practice, and the Sutta Piṭaka, a compilation of teachings based on his discourses. These were passed down in Middle Indo-Aryan dialects through an oral tradition. Later generations composed additional texts, such as systematic treatises known as Abhidharma, biographies of the Buddha, collections of stories about his past lives known as Jataka tales, and additional discourses, i.e., the Mahayana sutras. Buddhism evolved into a variety of traditions and practices, represented by Theravada, Mahayana and Vajrayana, and spread beyond the Indian subcontinent. While Buddhism declined in India, and mostly disappeared after the 8th century CE due to a lack of popular and economic support, Buddhism is more prominent in Southeast and East Asia."],
["Genghis Khan","Genghis.Khan@gov.mn","Genghis Khan (born Temüjin; c. 1162 – August 1227), also known as Chinggis Khan, was the founder and first khan of the Mongol Empire. After spending most of his life uniting the Mongol tribes, he launched a series of military campaigns, conquering large parts of China and Central Asia. Born between 1155 and 1167 and given the name Temüjin, he was the eldest child of Yesugei, a Mongol chieftain of the Borjigin clan, and his wife Hö'elün. When Temüjin was eight, his father died and his family was abandoned by its tribe. Reduced to near-poverty, Temüjin killed his older half-brother to secure his familial position. His charismatic personality helped to attract his first followers and to form alliances with two prominent steppe leaders named Jamukha and Toghrul; they worked together to retrieve Temüjin's newlywed wife Börte, who had been kidnapped by raiders. As his reputation grew, his relationship with Jamukha deteriorated into open warfare. Temüjin was badly defeated in c. 1187, and may have spent the following years as a subject of the Jin dynasty; upon reemerging in 1196, he swiftly began gaining power. Toghrul came to view Temüjin as a threat and launched a surprise attack on him in 1203. Temüjin retreated, then regrouped and overpowered Toghrul; after defeating the Naiman tribe and executing Jamukha, he was left as the sole ruler on the Mongolian steppe. Temüjin formally adopted the title 'Genghis Khan', the meaning of which is uncertain, at an assembly in 1206. Carrying out reforms designed to ensure long-term stability, he transformed the Mongols' tribal structure into an integrated meritocracy dedicated to the service of the ruling family. After thwarting a coup attempt from a powerful shaman, Genghis began to consolidate his power. In 1209, he led a large-scale raid into the neighbouring Western Xia, who agreed to Mongol terms the following year. He then launched a campaign against the Jin dynasty, which lasted for four years and ended in 1215 with the capture of the Jin capital Zhongdu. His general Jebe annexed the Central Asian state of Qara Khitai in 1218. Genghis was provoked to invade the Khwarazmian Empire the following year by the execution of his envoys; the campaign toppled the Khwarazmian state and devastated the regions of Transoxiana and Khorasan, while Jebe and his colleague Subutai led an expedition that reached Georgia and Kievan Rus'. In 1227, Genghis died while subduing the rebellious Western Xia; following a two-year interregnum, his third son and heir Ögedei acceded to the throne in 1229. Genghis Khan remains a controversial figure. He was generous and intensely loyal to his followers, but ruthless towards his enemies. He welcomed advice from diverse sources in his quest for world domination, for which he believed the shamanic supreme deity Tengri had destined him. The Mongol army under Genghis killed millions of people, yet his conquests also facilitated unprecedented commercial and cultural exchange over a vast geographical area. He is remembered as a backwards, savage tyrant in Russia and the Arab world, while recent Western scholarship has begun to reassess its previous view of him as a barbarian warlord. He was posthumously deified in Mongolia; modern Mongolians recognise him as the founding father of their nation."],
["Kenneth H. Rosen","kenneth.h.rosen@att.com", "Kenneth H. Rosen has had a long career as a Distinguished Member of the Technical Staff at AT&T Laboratories in Monmouth County, New Jersey. He currently holds the position of Visiting Research Professor at Monmouth University, where he teaches graduate courses in computer science. Dr. Rosen received his B.S. in Mathematics from the University of Michigan, Ann Arbor (1972), and his Ph.D. in Mathematics from M.I.T. (1976), where he wrote his thesis in the area of number theory under the direction of Harold Stark. Before joining Bell Laboratories in 1982, he held positions at the University of Colorado, Boulder; The Ohio State University, Columbus; and the University of Maine, Orono, where he was an associate professor of mathematics. While working at AT&T Labs, he taught at Monmouth University, teaching courses in discrete mathematics, coding theory, and data security. He currently teaches courses in algorithm design and in computer security and cryptography. Dr. Rosen has published numerous articles in professional journals in number theory and in mathematical modeling. He is the author of the widely used Elementary Number Theory and Its Applications, published by Pearson, currently in its sixth edition, which has been translated into Chinese. He is also the author of Discrete Mathematics and Its Applications, published by McGraw-Hill, currently in its seventh edition. Discrete Mathematics and Its Applications has sold more than 350,000 copies in North America during its lifetime, and hundreds of thousands of copies throughout the rest of the world. This book has also been translated into Spanish, French, Greek, Chinese,Vietnamese, and Korean. He is also co-author of UNIX: The Complete Reference; UNIX SystemV Release 4:An Introduction; and Best UNIXTips Ever, all published by Osborne McGraw-Hill. These books have sold more than 150,000 copies, with translations into Chinese, German, Spanish, and Italian. Dr. Rosen is also the editor of the Handbook of Discrete and Combinatorial Mathematics, published by CRC Press, and he is the advisory editor of the CRC series of books in discrete mathematics, consisting of more than 55 volumes on different aspects of discrete mathematics, most of which are introduced in this book. Dr. Rosen serves as an Associate Editor for the journal Discrete Mathematics, where he works with submitted papers in several areas of discrete mathematics, including graph theory, enumeration, and number theory. He is also interested in integrating mathematical software into the educational and professional environments, and worked on several projects with Waterloo Maple Inc.’s MapleTM software in both these areas. Dr. Rosen has also worked with several publishing companies on their homework delivery platforms. At Bell Laboratories andAT&T Laboratories, Dr. Rosenworked on a wide range of projects, including operations research studies, product line planning for computers and data communications equipment, and technology assessment. He helped planAT&T’s products and services in the area of multimedia, including video communications, speech recognition, speech synthesis, and image networking. He evaluated new technology for use by AT&T and did standards work in the area of image networking. He also invented many new services, and holds more than 55 patents. One of his more interesting projects involved helping evaluate technology for the AT&T attraction that was part of EPCOT Center."],
["Godfried Toussaint", "godfried.toussaint@nyuad.nyu.edu", "A Canadian computer scientist, a professor of computer science, and the head of the Computer Science Program at New York University Abu Dhabi (NYUAD) in Abu Dhabi, United Arab Emirates. He is considered to be the father of computational geometry in Canada. He did research on various aspects of computational geometry, discrete geometry, and their applications: pattern recognition (k-nearest neighbor algorithm, cluster analysis), motion planning, visualization (computer graphics), knot theory (stuck unknot problem), linkage (mechanical) reconfiguration, the art gallery problem, polygon triangulation, the largest empty circle problem, unimodality (unimodal function), and others. Other interests included meander (art), compass and straightedge constructions, instance-based learning, music information retrieval, and computational music theory."],
["Allen Forte", "Allen.Forte@yale.edu", "Allen Forte (December 23, 1926 – October 16, 2014) was an American music theorist and musicologist. He was Battell Professor Emeritus of the Theory of Music at Yale University and specialized in 20th-century atonal music and music analysis. In the late 1950s, Forte taught music at various New York institutions: Columbia University Teachers College, Manhattan School of Music, and Mannes College of Music. In fall 1959 he began his long-term appointment at Yale, where he eventually became the Battell Professor of Music (retiring in 2003). He was influential there as both scholar and teacher, and in the latter capacity served as advisor to seventy-two Ph.D. dissertations completed between 1968 and 2002. (Yale did not offer a Ph.D. in theory for the first several years Forte was there.) A list of all his advisees and their dissertation titles appears in David Carson Berry, 'The Twin Legacies of a Scholar-Teacher: The Publications and Dissertation Advisees of Allen Forte,' Gamut 2/1 (2009), 197-222. The list is ordered chronologically by submission, and each advisee is given an 'FA' number to denote his or her ordering among the advisees. ('FA' stands for 'Forte Advisee,' and is also a retrograde of Allen Forte's initials.) Forte taught at the Massachusetts Institute of Technology 1967–68 on integrating music theory with computer systems. He was also a visiting music professor at Harvard University in 2008 Forte is well known for his book The Structure of Atonal Music (1973), which traces many of its roots to an article of a decade earlier: 'A Theory of Set-Complexes for Music' (1964). In these works, he 'applied set-theoretic principles to the analysis of unordered collections of pitch classes, called pitch-class sets (pc sets). [...] The basic goal of Forte's theory was to define the various relationships that existed among the relevant sets of a work, so that contextual coherence could be demonstrated.' Although the methodology derived from Forte's work 'has had its detractors ... textbooks on post-tonal analysis now routinely teach it (to varying degrees).' Forte published analyses of the works of Webern and Berg and wrote about Schenkerian analysis and music of the Great American Songbook. A complete, annotated bibliography of his publications appears in the previously cited article, Berry, 'The Twin Legacies of a Scholar-Teacher.' Excluding items for which Forte was only an editor, it lists ten books, sixty-three articles, and thirty-six other types publications, from 1955 through early 2009. Forte was also the editor of the Journal of Music Theory during an important period in its development, from volume 4/2 (1960) through 11/1 (1967). His involvement with the journal, including many biographical details, is addressed in David Carson Berry, 'Journal of Music Theory under Allen Forte's Editorship,' Journal of Music Theory 50/1 (2006): 7-23. Forte was married to Herta Lynd Waitzfelder Sharland (1915–2000) and also to the French-born pianist Madeleine (Hsu) Forte, emerita professor of piano at Boise State University."],
["Arnold Schönberg","Arnold.Schoenberg@neuewienerschule.at","Arnold Schoenberg or Schönberg (13 September 1874 – 13 July 1951) was an Austrian and American composer, music theorist, teacher and writer. He was among the first modernists who transformed the practice of harmony in 20th-century classical music, and a central element of his music was its use of motives as a means of coherence. He propounded concepts like developing variation, the emancipation of the dissonance, and the 'unity of musical space'. Schoenberg's early works, like Verklärte Nacht (1899), represented a Brahmsian–Wagnerian synthesis on which he built. Mentoring Anton Webern and Alban Berg, he became the central figure of the Second Viennese School. They consorted with visual artists, published in Der Blaue Reiter, and wrote atonal, expressionist music, attracting fame and stirring debate. In his String Quartet No. 2 (1907–1908), Erwartung (1909), and Pierrot lunaire (1912), Schoenberg visited extremes of emotion; in self-portraits he emphasized his intense gaze. While working on Die Jakobsleiter (from 1914) and Moses und Aron (from 1923), Schoenberg confronted popular antisemitism by returning to Judaism and substantially developed his twelve-tone technique. He systematically interrelated all notes of the chromatic scale in his twelve-tone music, often exploiting combinatorial hexachords and sometimes admitting tonal elements. Schoenberg resigned from the Prussian Academy of Arts (1926–1933), emigrating as the Nazis took power; they banned his (and his students') music, labeling it 'degenerate'. He taught in the US, including at the University of California, Los Angeles (1936–1944), where facilities are named in his honor. He explored writing film music (as he had done idiosyncratically in Begleitungsmusik zu einer Lichtspielscene, 1929–1930) and wrote more tonal music, completing his Chamber Symphony No. 2 in 1939. With citizenship (1941) and US entry into World War II, he satirized fascist tyrants in Ode to Napoleon (1942, after Byron), deploying Beethoven's fate motif and the Marseillaise. Post-war Vienna beckoned with honorary citizenship, but Schoenberg was ill as depicted in his String Trio (1946). As the world learned of the Holocaust, he memorialized its victims in A Survivor from Warsaw (1947). The Israel Conservatory and Academy of Music elected him honorary president (1951). His innovative music was among the most influential and polemicized of 20th-century classical music. At least three generations of composers extended its somewhat formal principles. His aesthetic and music-historical views influenced musicologists Theodor W. Adorno and Carl Dahlhaus. The Arnold Schönberg Center collects his archival legacy."],
["Harold Stark","Harold.Stark@umich.edu", "Harold Mead Stark (born August 6, 1939) is an American mathematician, specializing in number theory. He is best known for his solution of the Gauss class number 1 problem, in effect correcting and completing the earlier work of Kurt Heegner, and for Stark's conjecture. More recently, he collaborated with Audrey Terras to study zeta functions in graph theory. He is currently on the faculty of the University of California, San Diego."],
["Richard P. Stanley","Richard.P.Stanley@mit.edu", "Notable for his work in combinatorics, particularly in enumerative combinatorics. Richard Peter Stanley (born June 23, 1944) is an Emeritus Professor of Mathematics at the Massachusetts Institute of Technology, and an Arts and Sciences Distinguished Scholar at the University of Miami. From 2000 to 2010, he was the Norman Levinson Professor of Applied Mathematics. He received his Ph.D. at Harvard University in 1971 under the supervision of Gian-Carlo Rota. He is an expert in the field of combinatorics and its applications to other mathematical disciplines."],
["Thomas H. Cormen","Thomas.H.Cormen@princeton.edu", "Co-author of 'Introduction to Algorithms', a widely used textbook in computer science. He is an American politician and retired academic. He is the co-author of Introduction to Algorithms, along with Charles Leiserson, Ron Rivest, and Cliff Stein. In 2013, he published a new book titled Algorithms Unlocked. He is an emeritus professor of computer science at Dartmouth College and former chairman of the Dartmouth College Department of Computer Science. Between 2004 and 2008 he directed the Dartmouth College Writing Program. His research interests are algorithm engineering, parallel computing, and speeding up computations with high latency. In 2022, he was elected as a Democratic member of the New Hampshire House of Representatives."],
["Robert Sedgewick","Robert.Sedgewick@princeton.edu", "Recognized for his contributions in algorithms and data structures Robert Sedgewick (born December 20, 1946) is an American computer scientist. He is the founding chair and the William O. Baker Professor in Computer Science at Princeton University and was a member of the board of directors of Adobe Systems (1990–2016). He previously served on the faculty at Brown University and has held visiting research positions at Xerox PARC, Institute for Defense Analyses, and INRIA. His research expertise is in algorithm science, data structures, and analytic combinatorics. He is also active in developing college curriculums in computer science."],
["Donald Trump", "Donald.Trump@whitehouse.gov", "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who has been the 47th and current president of the United States since 2025. A member of the Republican Party, he previously served as the 45th president from 2017 to 2021. Trump graduated with a bachelor's degree in economics from the University of Pennsylvania in 1968. He became president of the Trump family real estate business in 1971 and focused on luxury accommodations. After a series of business bankruptcies in the 1990s, he launched several side ventures. From 2004 to 2015, he hosted and co-produced the reality television series The Apprentice. Trump won the 2016 presidential election. His immigration policy included a temporary travel ban targeting refugees and nationals of certain Muslim-majority countries, and expanding the U.S.–Mexico border wall; he also briefly implemented a family separation policy. He rolled back more than 100 environmental policies and regulations, signed the Tax Cuts and Jobs Act of 2017, initiated a trade war with China in 2018, and withdrew the U.S. from international agreements on climate, trade, and the nuclear program of Iran. Trump became the first sitting U.S. president to enter North Korea when he met with Kim Jong Un; they did not reach an agreement on denuclearization. He nominated three Supreme Court justices in his first term. Trump's response to the COVID-19 pandemic downplayed its severity, contradicted guidance from international public health bodies, and included the CARES Act economic stimulus. He was impeached in 2019 for abuse of power and obstruction of Congress, and in 2021 for incitement of insurrection; the Senate acquitted him in both cases. After his first term, scholars and historians ranked Trump as one of the worst presidents in American history. Trump's politics led to the Trumpism movement. Many of his comments and actions have been characterized as racially charged, racist, and misogynistic. He promoted conspiracy theories and made false and misleading statements during his campaigns and presidency to a degree unprecedented in American politics. He lost the 2020 presidential election but did not concede, falsely claiming widespread electoral fraud and attempting to overturn the results, including through his involvement in the January 6 United States Capitol attack. In civil proceedings, he was found liable for sexual abuse and defamation in 2023, and financial fraud in 2024. He was found guilty of falsifying business records in May 2024 and sentenced to unconditional discharge in January 2025, making him the first U.S. president to be convicted of a felony. Two felony indictments related to interference in the 2020 election and his handling of classified documents were dismissed without prejudice following his victory in the 2024 presidential election."],
["Brian Hugh Warner", "brian.hugh.warner@marilynmanson.net", "Brian Hugh Warner (born January 5, 1969), known professionally as Marilyn Manson, is an American rock musician who rose to prominence as the lead singer (and only constant member) of the band he formed in 1989 with Daisy Berkowitz. The band members created their stage names by combining the first name of an American female sex symbol with the last name of a male serial killer, like actress Marilyn Monroe and cult leader Charles Manson. In the 1990s, the band released the albums Portrait of an American Family (1994), Antichrist Superstar (1996) and Mechanical Animals (1998). In the U.S. alone, three of the band's albums have been awarded platinum status and three more went gold, and the band has had eight releases debut in the top 10, including two No. 1 albums. Manson has been ranked at No. 44 on the list of the 'Top 100 Heavy Metal Vocalists' by Hit Parader and, along with his band, has been nominated for four Grammy Awards – Manson himself earned an additional Grammy nomination for his work on Kanye West's Donda (2021). Manson made his film debut as an actor in David Lynch's Lost Highway (1997), and has since appeared in a variety of minor roles and cameos. In 2002, his first art show, The Golden Age of Grotesque, was held at the Los Angeles Contemporary Exhibitions center. His music and stage personality have earned Manson a reputation in mainstream media as a controversial figure and negative influence on young people. He is widely considered one of the most controversial figures in heavy metal, and has been involved in numerous controversies throughout his career. His lyrics were criticized by American politicians and were examined in congressional hearings. Several U.S. states enacted legislation specifically banning the group from performing in state-operated venues. In 1999, news media falsely blamed Manson for influencing the perpetrators of the Columbine High School massacre. His work has been cited in several other violent events; his paintings and films appeared as evidence in a murder trial, and he has been accused of inspiring several other murders and school shootings. In 2021 former partner Evan Rachel Wood accused Manson of psychologically and sexually abusing her, allegations he denied. Four other women followed with similar accusations. He sued Wood for defamation (but later dropped the lawsuit and paid her legal fees)."],
["Sylvester Stallone", "sylvester.stallone@outlook.com", "Sylvester Gardenzio 'Sly' Stallone (/stəˈloʊn/; born July 6, 1946) is an American actor and filmmaker. In a film career spanning more than fifty years, Stallone has received numerous accolades, including a Golden Globe Award and a Critics' Choice Award, as well as nominations for three Academy Awards and two BAFTA Awards. Stallone is one of only two actors in history (alongside Harrison Ford) to have starred in a box-office No. 1 film across six consecutive decades. Struggling as an actor for a number of years upon moving to New York City in 1969, Stallone found gradual work in films such as The Lords of Flatbush (1974). He achieved his greatest critical and commercial success starting in 1976 with his iconic role as boxer Rocky Balboa in the first film of the successful Rocky franchise, which he also wrote. In 1977, he became the third actor in history to be nominated for two Academy Awards for Best Original Screenplay and Best Actor. He portrayed the PTSD-plagued soldier John Rambo in First Blood (1982), a role he would play across five Rambo films (1982–2019). He received a star on the Hollywood Walk of Fame in 1984. From the mid-1980s to the late 1990s, Stallone would go on to become one of Hollywood's highest-paid actors acting in action films such as Cobra (1986), Tango and Cash (1989), Cliffhanger (1993), Demolition Man (1993), and The Specialist (1994). At the height of his career, Stallone was known for his rivalry with Arnold Schwarzenegger. Stallone continued his established roles in Rocky Balboa (2006) and Rambo (2008) before launching The Expendables film franchise (2010–present), in which he starred as the mercenary Barney Ross. In 2013, he starred in the successful film Escape Plan and appeared in its sequels. In 2015, he returned to Rocky again with Creed, in which a retired Rocky mentors former rival Apollo Creed's son Donnie Creed. The film brought Stallone widespread praise and his first Golden Globe Award, as well as a third Academy Award nomination, having been first nominated for the same role 40 years prior. He also starred in the sequel Creed II (2018) and portrayed Stakar Ogord in the Marvel Cinematic Universe films Guardians of the Galaxy Vol. 2 (2017) and Guardians of the Galaxy Vol. 3 (2023). Regarded as an icon of action cinema, Stallone is credited with helping redefine the Hollywood action hero. He has occasionally ventured from the action genre, with mixed results. He starred in the comedies Oscar (1991) and Stop! Or My Mom Will Shoot (1992), both of which had modest success. He also starred in the 1997 drama Cop Land, for which he temporarily shed his sculpted physique and gained weight for his role as a powerless sheriff. In television, he has starred in the Paramount+ crime series Tulsa King (2022–present). In addition to his film work, Stallone is a noted art collector and painter, and has written books on fitness."],
["Mel Gibson", "mel.gibson@outlook.com", "Mel Columcille Gerard Gibson (born January 3, 1956) is an American actor and filmmaker. The recipient of multiple accolades, he is known for directing historical films as well for his action hero roles, particularly his breakout role as Max Rockatansky in the first three films of the post-apocalyptic series Mad Max (1979–1985) and as Martin Riggs in the buddy cop series Lethal Weapon (1987–1998). Born in Peekskill, New York, Gibson moved with his parents to Sydney, Australia, when he was 12 years old. He studied acting at the National Institute of Dramatic Art, where he starred opposite Judy Davis in a production of Romeo and Juliet. During the 1980s, he founded Icon Entertainment, a production company. Director Peter Weir cast him as one of the leads in the World War I drama Gallipoli (1981), which earned Gibson a Best Actor Award from the Australian Film Institute. In 1995, Gibson produced, directed, and starred in the war film Braveheart for which he won the Golden Globe Award for Best Director, the Academy Award for Best Director, and the Academy Award for Best Picture. He later directed and produced The Passion of the Christ (2004), a biblical drama that was both financially successful and highly controversial. He received further critical notice for directing the action-adventure film Apocalypto (2006), set in Mesoamerica during the early 16th century. His notable acting roles during this period were in Ransom (1996), Payback (1999), What Women Want (2000), The Patriot (2000), and Signs (2002). After several legal issues and controversial statements leaked to the public, Gibson's popularity in Hollywood declined, affecting his career. He subsequently starred in Edge of Darkness (2010) and Jodie Foster's The Beaver (2011). His directorial comeback after an absence of 10 years, Hacksaw Ridge (2016), won two Academy Awards."],
["Terrence Andrew Davis","Terrence.Andrew.Davis@aol.com","Terrence Andrew Davis (December 15, 1969 – August 11, 2018) was an American electrical engineer and computer programmer best known for creating and designing TempleOS, an operating system in the public domain, by himself. As a teenager, Davis learned assembly language on a Commodore 64. He later earned both a bachelor's degree in computer engineering and a master's degree in electrical engineering from Arizona State University. He worked for several years at Ticketmaster as a programmer for VAX machines. In 1996, he began experiencing regular manic episodes, one of which led him to hospitalization. Initially diagnosed with bipolar disorder, he was later declared to have schizophrenia. He subsequently collected disability payments and resided in Las Vegas with his parents until 2017. Growing up Catholic, Davis was an atheist for some of his adult life. After experiencing a self-described 'revelation', he proclaimed that he had been in direct communication with God and that God had commanded him to build a successor to the Second Temple. He then committed a decade to creating an operating system modeled after the DOS-based interfaces of his youth. In 2013, Davis announced that he had completed the project, now called 'TempleOS'. The operating system was generally regarded as a hobby system, not suitable for general use, but Davis received sympathy and support from the general public for bringing the project to fruition. Davis amassed an online following and regularly posted video blogs to social media. Although he remained lucid when discussing computer-related subjects, his communication skills were significantly affected by his schizophrenia. He was controversial for his regular use of slurs, which he explained was his way of combating factors of psychological warfare. After 2017, he struggled with periods of homelessness and incarceration."],
["Paul Reubens", "Paul.Reubens@peeweeherman.com", "Pee-wee Herman is a comedy character created and portrayed by the American comedian Paul Reubens. He starred in films and television series during the 1980s. The childlike Pee-wee Herman character developed as a stage act that quickly led to an HBO special in 1981. As the stage performance gained further popularity, Reubens took the character to motion picture with Pee-wee's Big Adventure in 1985, toning down the adult innuendo for the appeal of children. This paved the way for Pee-wee's Playhouse, an Emmy Award-winning children's series that ran on CBS from 1986 to 1991. Another film, Big Top Pee-wee, was released in 1988. Because of negative media attention following a scandal in 1991, Reubens decided to shelve his alter ego during the 1990s, but gradually resurrected it during the following decade. It was at that time that Reubens addressed plans to write a new Pee-wee film, Pee-wee's Playhouse: The Movie. In June 2007, Reubens appeared as Pee-wee Herman at the Spike TV's Guys' Choice Awards for the first time on television since 1992. After a lengthy hiatus, a third film, Pee-wee's Big Holiday, was released by Netflix in 2016."],
["Bill Gates", "bill@gatesnotes.com", "William Henry Gates III (born October 28, 1955) is an American businessman and philanthropist best known for co-founding the software company Microsoft with his childhood friend Paul Allen. He later held the positions of chairman, chief executive officer (CEO), president, and chief software architect of the company. Gates was also its largest individual shareholder until May 2014. He was a pioneer of the microcomputer revolution of the 1970s and 1980s. In June 2008, Gates transitioned into a part-time role at Microsoft and full-time work at the Bill & Melinda Gates Foundation, the private charitable foundation he and his then-wife Melinda had established in 2000. He stepped down as chairman of the Microsoft board in February 2014 and assumed the role of technology adviser to support newly appointed CEO Satya Nadella. In March 2020, Gates left his board positions at Microsoft and Berkshire Hathaway to focus on his philanthropic efforts on climate change, global health and development, and education. Gates was born and raised in Seattle, Washington. In 1975, he and Allen founded Microsoft in Albuquerque, New Mexico. Gates led the company as its chairman and chief executive officer until stepping down as CEO in January 2000, succeeded by Steve Ballmer, but he remained chairman of the board of directors and became chief software architect. During the late 1990s, he was criticized for his business tactics, which were considered anti-competitive. Since 1987, Gates has been included in the Forbes list of the world's top billionaires. From 1995 to 2017, he held the title of the wealthiest person in the world every year except in 2008 and from 2010 to 2013. In 1999, he became the first ever centibillionaire when his net worth briefly surpassed US$100 billion. Since leaving day-to-day operations at Microsoft in 2008, Gates has pursued other business and philanthropic endeavors. He is the founder and chairman of several companies, including BEN, Cascade Investment, TerraPower, Gates Ventures, and Breakthrough Energy. He has donated to various charitable organizations and scientific research programs through the Bill & Melinda Gates Foundation, reported to be the world's largest private charity. Through the foundation, he led an early 21st century vaccination campaign that significantly contributed to the eradication of the wild poliovirus in Africa. In 2010, Gates and Warren Buffett founded the Giving Pledge, whereby they and other billionaires pledge to give at least half of their wealth towards philanthropy."],
["Friedrich Wilhelm Nietzsche","Friedrich.Wilhelm.Nietzsche@unibas.ch","Friedrich Wilhelm Nietzsche (15 October 1844 – 25 August 1900) was a German classical scholar, philosopher, and critic of culture, who became one of the most influential of all modern thinkers. He began his career as a classical philologist before turning to philosophy. In 1869 at the age of 24, he became the youngest person to hold the Chair of Classical Philology at the University of Basel in Switzerland. In 1879 he resigned due to health problems that plagued him most of his life, after which he completed much of his core writing in the following decade. In 1889 at age 44, he suffered a collapse and afterward a complete loss of his mental faculties, with paralysis and probably vascular dementia. He lived his remaining years in the care of his mother until her death in 1897, and then with his sister Elisabeth Förster-Nietzsche. Nietzsche died in 1900, after experiencing pneumonia and multiple strokes. Nietzsche's work spans philosophical polemics, poetry, cultural criticism, and fiction while displaying a fondness for aphorism and irony. Prominent elements of his philosophy include his radical critique of truth in favour of perspectivism; a genealogical critique of religion and Christian morality and a related theory of master–slave morality; the aesthetic affirmation of life in response to both the 'death of God' and the profound crisis of nihilism; the notion of Apollonian and Dionysian forces; and a characterisation of the human subject as the expression of competing wills, collectively understood as the will to power. He also developed influential concepts such as the Übermensch and his doctrine of eternal return. In his later work, he became increasingly preoccupied with the creative powers of the individual to overcome cultural and moral mores in pursuit of new values and aesthetic health. His body of work touched a wide range of topics, including art, philology, history, music, religion, tragedy, culture, and science, and drew inspiration from Greek tragedy as well as figures such as Zoroaster, Arthur Schopenhauer, Ralph Waldo Emerson, Richard Wagner, Fyodor Dostoevsky, and Johann Wolfgang von Goethe. After his death, Nietzsche's sister Elisabeth became the curator and editor of his manuscripts. She edited his unpublished writings to fit her German ultranationalist ideology, often contradicting or obfuscating Nietzsche's stated opinions, which were explicitly opposed to antisemitism and nationalism. Through her published editions, Nietzsche's work became associated with fascism and Nazism. 20th-century scholars such as Walter Kaufmann, R. J. Hollingdale, and Georges Bataille defended Nietzsche against this interpretation, and corrected editions of his writings were soon made available. Nietzsche's thought enjoyed renewed popularity in the 1960s and his ideas have since had a profound impact on 20th- and early 21st-century thinkers across philosophy—especially in schools of continental philosophy such as existentialism, postmodernism, and post-structuralism—as well as art, literature, music, poetry, politics, and popular culture."],
["Bertrand Russel","Bertrand.Russel@trin.cam.ac.uk","Bertrand Arthur William Russell, 3rd Earl Russell, OM, FRS (18 May 1872 – 2 February 1970) was a British philosopher, logician, mathematician, and public intellectual. He had influence on mathematics, logic, set theory, and various areas of analytic philosophy. He was one of the early 20th century's prominent logicians and a founder of analytic philosophy, along with his predecessor Gottlob Frege, his friend and colleague G. E. Moore, and his student and protégé Ludwig Wittgenstein. Russell with Moore led the British 'revolt against idealism'. Together with his former teacher A. N. Whitehead, Russell wrote Principia Mathematica, a milestone in the development of classical logic and a major attempt to reduce the whole of mathematics to logic (see logicism). Russell's article 'On Denoting' has been considered a 'paradigm of philosophy'. Russell was a pacifist who championed anti-imperialism and chaired the India League. He went to prison for his pacifism during World War I, and initially supported appeasement against Adolf Hitler's Nazi Germany, before changing his view in 1943, describing war as a necessary 'lesser of two evils'. In the wake of World War II, he welcomed American global hegemony in preference to either Soviet hegemony or no (or ineffective) world leadership, even if it were to come at the cost of using their nuclear weapons. He would later criticise Stalinist totalitarianism, condemn the United States' involvement in the Vietnam War, and become an outspoken proponent of nuclear disarmament. In 1950, Russell was awarded the Nobel Prize in Literature 'in recognition of his varied and significant writings in which he champions humanitarian ideals and freedom of thought'. He was also the recipient of the De Morgan Medal (1932), Sylvester Medal (1934), Kalinga Prize (1957), and Jerusalem Prize (1963)."],
["Ludwig Wittgenstein","Ludwig.Wittgenstein@cam.ac.uk","Ludwig Josef Johann Wittgenstein (/ˈvɪtɡənʃtaɪn, -staɪn/ VIT-gən-s(h)tyne, Austrian German: [ˈluːdvɪk ˈjoːsɛf ˈjoːhan ˈvɪtɡn̩ʃtaɪn]; 26 April 1889 – 29 April 1951) was an Austrian philosopher who worked primarily in logic, the philosophy of mathematics, the philosophy of mind, and the philosophy of language. From 1929 to 1947, Wittgenstein taught at the University of Cambridge. Despite his position, only one book of his philosophy was published during his entire life: the 75-page Logisch-Philosophische Abhandlung (Logical-Philosophical Treatise, 1921), which appeared, together with an English translation, in 1922 under the Latin title Tractatus Logico-Philosophicus. His only other published works were an article, 'Some Remarks on Logical Form' (1929); a book review; and a children's dictionary.[a][b] His voluminous manuscripts were edited and published posthumously. The first and best-known of this posthumous series is the 1953 book Philosophical Investigations. A 1999 survey among American university and college teachers ranked the Investigations as the most important book of 20th-century philosophy, standing out as 'the one crossover masterpiece in twentieth-century philosophy, appealing across diverse specializations and philosophical orientations'. His philosophy is often divided into an early period, exemplified by the Tractatus, and a later period, articulated primarily in the Philosophical Investigations. The 'early Wittgenstein' was concerned with the logical relationship between propositions and the world, and he believed that by providing an account of the logic underlying this relationship, he had solved all philosophical problems. The 'later Wittgenstein', however, rejected many of the assumptions of the Tractatus, arguing that the meaning of words is best understood as their use within a given language game. More precisely, Wittgenstein wrote, 'For a large class of cases of the employment of the word 'meaning' — though not for all — this word can be explained in this way: the meaning of a word is its use in the language.' Born in Vienna into one of Europe's richest families, he inherited a fortune from his father in 1913. Before World War I, he 'made a very generous financial bequest to a group of poets and artists chosen by Ludwig von Ficker, the editor of Der Brenner, from artists in need. These included [Georg] Trakl as well as Rainer Maria Rilke and the architect Adolf Loos.' 'In autumn 1916, as his sister reported, 'Ludwig made a donation of a million crowns ['equivalent to about $2,869,000 in 2016 dollars'] for the construction of a 30cm mortar.'' Later, in a period of severe personal depression after World War I, he gave away his remaining fortune to his brothers and sisters. Three of his four older brothers died by separate acts of suicide. Wittgenstein left academia several times: serving as an officer on the front line during World War I, where he was decorated a number of times for his courage; teaching in schools in remote Austrian villages, where he encountered controversy for using sometimes violent corporal punishment on both girls and boys (see, for example, the Haidbauer incident), especially during mathematics classes; working during World War II as a hospital porter in London; and working as a hospital laboratory technician at the Royal Victoria Infirmary in Newcastle upon Tyne."],
["Albert Einstein","Albert.Einstein@uzh.ch","Albert Einstein (/ˈaɪnstaɪn/, EYEN-styne; German: [ˈalbɛʁt ˈʔaɪnʃtaɪn]; 14 March 1879 – 18 April 1955) was a German-born theoretical physicist who is best known for developing the theory of relativity. Einstein also made important contributions to quantum mechanics.[1][5] His mass–energy equivalence formula E = mc2, which arises from special relativity, has been called 'the world's most famous equation'. He received the 1921 Nobel Prize in Physics for his services to theoretical physics, and especially for his discovery of the law of the photoelectric effect.Born in the German Empire, Einstein moved to Switzerland in 1895, forsaking his German citizenship the following year. In 1897, at the age of seventeen he enrolled in the mathematics and physics teaching diploma program at the Swiss Federal Polytechnic School in Zurich, graduating in 1900. He acquired Swiss citizenship a year later and afterwards secured a permanent position at the Swiss Patent Office in Bern. In 1905, he submitted a successful PhD dissertation to the University of Zurich. In 1914, he moved to Berlin to join the Prussian Academy of Sciences and the Humboldt University of Berlin, becoming director of the Kaiser Wilhelm Institute for Physics. In 1933, while Einstein was visiting the United States, Adolf Hitler came to power in Germany. Horrified by the Nazi persecution of his fellow Jews, he decided to remain in the US, and was granted American citizenship in 1940. On the eve of World War II, he endorsed a letter to President Franklin D. Roosevelt alerting him to the potential German nuclear weapons program and recommending that the US begin similar research. In 1905, he published four groundbreaking papers, sometimes described as his annus mirabilis (miracle year). These papers outlined a theory of the photoelectric effect, explained Brownian motion, introduced his special theory of relativity, and demonstrated that if the special theory is correct, mass and energy are equivalent to each other. In 1915, he proposed a general theory of relativity that extended his system of mechanics to incorporate gravitation. A cosmological paper that he published the following year laid out the implications of general relativity for the modeling of the structure and evolution of the universe as a whole. In 1917, Einstein wrote a paper which introduced the concepts of spontaneous emission and stimulated emission, the latter of which is the core mechanism behind the laser and maser, and which contained a trove of information that would be beneficial to developments in physics later on, such as quantum electrodynamics and quantum optics. A joint paper in 1935, with physicist Nathan Rosen, introduced the notion of a wormhole. Alongside physicist Leo Szilard, he invented a refrigerator that consisted of no moving parts and used only heat as an input. In the middle part of his career, Einstein made important contributions to statistical mechanics and quantum theory. Especially notable was his work on the quantum physics of radiation, in which light consists of particles, subsequently called photons. With physicist Satyendra Nath Bose, he laid the groundwork for Bose-Einstein statistics. For much of the last phase of his academic life, Einstein worked on two endeavors that ultimately proved unsuccessful. First, he advocated against quantum theory's introduction of fundamental randomness into science's picture of the world, objecting that God does not play dice. Second, he attempted to devise a unified field theory by generalizing his geometric theory of gravitation to include electromagnetism. As a result, he became increasingly isolated from mainstream modern physics. In 1999, he was named Time's Person of the Century."],
["Karl Marx","Karl.Marx@uni-jena.de","Karl Marx (German: [kaʁl ˈmaʁks]; 5 May 1818 – 14 March 1883) was a German-born philosopher, political theorist, political economist, historian, sociologist, journalist, and revolutionary socialist. His best-known works are the 1848 pamphlet The Communist Manifesto (with Friedrich Engels) and his three-volume Das Kapital (1867–1894); the latter employs his critical approach of historical materialism in an analysis of capitalism, in the culmination of his intellectual endeavours. Marx's ideas and their subsequent development, collectively known as Marxism, have had enormous influence on modern intellectual, economic and political history. Born in Trier in the Kingdom of Prussia, Marx studied at the universities of Bonn, Berlin, and Jena, and received a doctorate in philosophy from the latter in 1841. A Young Hegelian, he was influenced by the philosophy of Georg Wilhelm Friedrich Hegel, and both critiqued and developed Hegel's ideas in works such as The German Ideology (written 1846) and the Grundrisse (written 1857–1858). While in Paris in 1844, Marx wrote his Economic and Philosophic Manuscripts and met Engels, who became his closest friend and collaborator. After moving to Brussels in 1845, they were active in the Communist League, and in 1848 they wrote The Communist Manifesto, which expresses Marx's ideas and lays out a programme for revolution. Marx was expelled from Belgium and Germany, and in 1849 moved to London, where he wrote The Eighteenth Brumaire of Louis Bonaparte (1852) and Das Kapital. From 1864, Marx was involved in the International Workingmen's Association (First International), in which he fought the influence of anarchists led by Mikhail Bakunin. In his Critique of the Gotha Programme (1875), Marx wrote on revolution, the state and the transition to communism. He died stateless in 1883 and was buried in Highgate Cemetery. Marx's critiques of history, society and political economy hold that human societies develop through class conflict. In the capitalist mode of production, this manifests itself in the conflict between the ruling classes (known as the bourgeoisie) that control the means of production and the working classes (known as the proletariat) that enable these means by selling their labour power in return for wages. Employing his historical materialist approach, Marx predicted that capitalism produced internal tensions like previous socioeconomic systems and that these tensions would lead to its self-destruction and replacement by a new system known as the socialist mode of production. For Marx, class antagonisms under capitalism—owing in part to its instability and crisis-prone nature—would eventuate the working class's development of class consciousness, leading to their conquest of political power and eventually the establishment of a classless, communist society constituted by a free association of producers. Marx actively pressed for its implementation, arguing that the working class should carry out organised proletarian revolutionary action to topple capitalism and bring about socio-economic emancipation. Marx has been described as one of the most influential figures of the modern era, and his work has been both lauded and criticised. Marxism has exerted major influence on socialist thought and political movements, with Marxist schools of thought such as Marxism–Leninism and its offshoots becoming the guiding ideologies of revolutionary governments that took power in many countries during the 20th century, known as communist states. Marx's work in economics has had a strong influence on modern heterodox theories of labour and capital, and he is often cited as one of the principal architects of modern sociology."],
["Aristotle","Aristotle@platonic-academy.edu","Aristotle (Attic Greek: Ἀριστοτέλης, romanized: Aristotélēs; 384–322 BC) was an Ancient Greek philosopher and polymath. His writings cover a broad range of subjects spanning the natural sciences, philosophy, linguistics, economics, politics, psychology, and the arts. As the founder of the Peripatetic school of philosophy in the Lyceum in Athens, he began the wider Aristotelian tradition that followed, which set the groundwork for the development of modern science. Little is known about Aristotle's life. He was born in the city of Stagira in northern Greece during the Classical period. His father, Nicomachus, died when Aristotle was a child, and he was brought up by a guardian. At around eighteen years old, he joined Plato's Academy in Athens and remained there until the age of thirty seven (c. 347 BC). Shortly after Plato died, Aristotle left Athens and, at the request of Philip II of Macedon, tutored his son Alexander the Great beginning in 343 BC. He established a library in the Lyceum, which helped him to produce many of his hundreds of books on papyrus scrolls. Though Aristotle wrote many treatises and dialogues for publication, only around a third of his original output has survived, none of it intended for publication. Aristotle provided a complex synthesis of the various philosophies existing prior to him. His teachings and methods of inquiry have had a significant impact across the world, and remain a subject of contemporary philosophical discussion. Aristotle's views profoundly shaped medieval scholarship. The influence of his physical science extended from late antiquity and the Early Middle Ages into the Renaissance, and was not replaced systematically until the Enlightenment and theories such as classical mechanics were developed. He influenced Judeo-Islamic philosophies during the Middle Ages, as well as Christian theology, especially the Neoplatonism of the Early Church and the scholastic tradition of the Catholic Church. Aristotle was revered among medieval Muslim scholars as 'The First Teacher', and among medieval Christians like Thomas Aquinas as simply 'The Philosopher', while the poet Dante called him 'the master of those who know'. He has been referred to as the first scientist. His works contain the earliest known formal study of logic, and were studied by medieval scholars such as Peter Abelard and Jean Buridan. His influence on logic continued well into the 19th century. In addition, his ethics, although always influential, has gained renewed interest with the modern advent of virtue ethics."],
["Jacques Derrida","Jacques.Derrida@ens.psl.eu","Jacques Derrida (/ˈdɛrɪdə/; French: [ʒak dɛʁida]; born Jackie Élie Derrida; 15 July 1930 – 9 October 2004) was a French Algerian philosopher. He developed the philosophy of deconstruction, which he utilized in a number of his texts, and which was developed through close readings of the linguistics of Ferdinand de Saussure and Husserlian and Heideggerian phenomenology. He is one of the major figures associated with post-structuralism and postmodern philosophy although he distanced himself from post-structuralism and disavowed the word 'postmodernity'. During his career, Derrida published over 40 books, together with hundreds of essays and public presentations. He has had a significant influence on the humanities and social sciences, including philosophy, literature, law, anthropology, historiography, applied linguistics, sociolinguistics, psychoanalysis, music, architecture, and political theory. Into the 2000s, his work retained major academic influence throughout the United States, continental Europe, South America and all other countries where continental philosophy has been predominant, particularly in debates around ontology, epistemology (especially concerning social sciences), ethics, aesthetics, hermeneutics, and the philosophy of language. In most of the Anglosphere, where analytic philosophy is dominant, Derrida's influence is most presently felt in literary studies due to his longstanding interest in language and his association with prominent literary critics from his time at Yale. He also influenced architecture (in the form of deconstructivism), music (especially in the musical atmosphere of hauntology), art, and art criticism. Particularly in his later writings, Derrida addressed ethical and political themes in his work. Some critics consider Speech and Phenomena (1967) to be his most important work, while others cite Of Grammatology (1967), Writing and Difference (1967), and Margins of Philosophy (1972). These writings influenced various activists and political movements. He became a well-known and influential public figure, while his approach to philosophy and the notorious abstruseness of his work made him controversial."],
["Marcus Aurelius","Marcus.Aurelius@roma.it","Marcus Aurelius Antoninus (Latin: [ˈmaːrkʊs au̯ˈreːliʊs antoːˈniːnʊs]; English: /ɔːˈriːliəs/ or-EE-lee-əs; 26 April 121 – 17 March 180) was Roman emperor from 161 to 180 and a Stoic philosopher. He was a member of the Nerva–Antonine dynasty, the last of the rulers later known as the Five Good Emperors and the last emperor of the Pax Romana, an age of relative peace, calm, and stability for the Roman Empire lasting from 27 BC to 180 AD. He served as Roman consul in 140, 145, and 161. Marcus Aurelius was the son of the praetor Marcus Annius Verus and his wife, Domitia Calvilla. He was related through marriage to the emperors Trajan and Hadrian. Marcus was three when his father died, and was raised by his mother and paternal grandfather. After Hadrian's adoptive son, Aelius Caesar, died in 138, Hadrian adopted Marcus's uncle Antoninus Pius as his new heir. In turn, Antoninus adopted Marcus and Lucius, the son of Aelius. Hadrian died that year, and Antoninus became emperor. Now heir to the throne, Marcus studied Greek and Latin under tutors such as Herodes Atticus and Marcus Cornelius Fronto. He married Antoninus's daughter Faustina in 145. After Antoninus died in 161, Marcus acceded to the throne alongside his adoptive brother, who took the regnal name Lucius Aurelius Verus. Under the reign of Marcus Aurelius, the Roman Empire witnessed much military conflict. In the East, the Romans fought the Parthian war of Lucius Verus with a revitalised Parthian Empire and the rebel Kingdom of Armenia. Marcus defeated the Marcomanni, Quadi, and Sarmatian Iazyges in the Marcomannic Wars. These and other Germanic peoples began to represent a troubling reality for the Empire. He reduced the silver purity of the Roman currency, the denarius. The persecution of Christians in the Roman Empire appears to have increased during his reign, although his involvement is unlikely since there are no Christian sources ascribing him the blame, and he was praised by Justin Martyr and Tertullian. The Antonine Plague broke out in 165 or 166 and devastated the population of the Roman Empire, causing the deaths of five to ten million people. Lucius Verus may have died from the plague in 169. When Marcus himself died in 180, he was succeeded by his son Commodus. Commodus's succession after Marcus has been a subject of debate among both contemporary and modern historians. The Column of Marcus Aurelius and Equestrian Statue of Marcus Aurelius still stand in Rome, where they were erected in celebration of his military victories. As a philosopher, his work Meditations is one of the most important sources for the modern understanding of ancient Stoic philosophy. These writings have been praised by fellow writers, philosophers, monarchs, and politicians centuries after his death."],
["Julius Caesar","Julius.Caesar@roma.it","Gaius Julius Caesar (12 July 100 BC – 15 March 44 BC) was a Roman general and statesman. A member of the First Triumvirate, Caesar led the Roman armies in the Gallic Wars before defeating his political rival Pompey in a civil war, and subsequently became dictator from 49 BC until his assassination in 44 BC. He played a critical role in the events that led to the demise of the Roman Republic and the rise of the Roman Empire. In 60 BC, Caesar, Crassus, and Pompey formed the First Triumvirate, an informal political alliance that dominated Roman politics for several years. Their attempts to amass political power were opposed by many in the Senate, among them Cato the Younger with the private support of Cicero. Caesar rose to become one of the most powerful politicians in the Roman Republic through a string of military victories in the Gallic Wars, completed by 51 BC, which greatly extended Roman territory. During this time he both invaded Britain and built a bridge across the river Rhine. These achievements and the support of his veteran army threatened to eclipse the standing of Pompey, who had realigned himself with the Senate after the death of Crassus in 53 BC. With the Gallic Wars concluded, the Senate ordered Caesar to step down from his military command and return to Rome. In 49 BC, Caesar openly defied the Senate's authority by crossing the Rubicon and marching towards Rome at the head of an army. This began Caesar's civil war, which he won, leaving him in a position of near-unchallenged power and influence in 45 BC. After assuming control of government, Caesar began a programme of social and governmental reform, including the creation of the Julian calendar. He gave citizenship to many residents of far regions of the Roman Republic. He initiated land reforms to support his veterans and initiated an enormous building programme. In early 44 BC, he was proclaimed 'dictator for life' (dictator perpetuo). Fearful of his power and domination of the state, a group of senators led by Brutus and Cassius assassinated Caesar on the Ides of March (15 March) 44 BC. A new series of civil wars broke out and the constitutional government of the Republic was never fully restored. Caesar's great-nephew and adopted heir Octavian, later known as Augustus, rose to sole power after defeating his opponents in the last civil war of the Roman Republic. Octavian set about solidifying his power, and the era of the Roman Empire began. Caesar was an accomplished author and historian as well as a statesman; much of his life is known from his own accounts of his military campaigns. Other contemporary sources include the letters and speeches of Cicero and the historical writings of Sallust. Later biographies of Caesar by Suetonius and Plutarch are also important sources. Caesar is considered by many historians to be one of the greatest military commanders in history. His cognomen was subsequently adopted as a synonym for 'Emperor'; the title 'Caesar' was used throughout the Roman Empire, giving rise to modern descendants such as Kaiser and Tsar. He has frequently appeared in literary and artistic works."]
]